{"backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "activation": "relu", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "filters": 64, "batch_input_shape": [null, 100, 10, 1], "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "filters": 128, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_2"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "trainable": false, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_3"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "trainable": false, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_4"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_4"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "name": "conv5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "trainable": false, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "filters": 16, "dilation_rate": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "config": {"center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_5"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": false}}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "name": "fc1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "name": "fc2"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"units": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "name": "fc3"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": false, "name": "dropout_8"}}, {"class_name": "Dense", "config": {"units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "name": "fc4"}}], "class_name": "Sequential"}