{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "dtype": "float32", "use_bias": true, "name": "conv2d_11", "batch_input_shape": [null, 100, 10, 1], "trainable": true, "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_11", "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_17"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "filters": 128, "use_bias": true, "name": "conv2d_12", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_12", "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_18"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "filters": 32, "use_bias": true, "name": "conv2d_13", "trainable": true, "kernel_constraint": null, "kernel_size": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_13", "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_19"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "filters": 32, "use_bias": true, "name": "conv2d_14", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_14", "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_20"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "filters": 16, "use_bias": true, "name": "conv2d_15", "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "scale": true, "name": "batch_normalization_15", "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_21"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"units": 128, "activation": "relu", "kernel_constraint": null, "use_bias": true, "name": "dense_9", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_22"}}, {"class_name": "Dense", "config": {"units": 64, "activation": "relu", "kernel_constraint": null, "use_bias": true, "name": "dense_10", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_23"}}, {"class_name": "Dense", "config": {"units": 32, "activation": "relu", "kernel_constraint": null, "use_bias": true, "name": "dense_11", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_24"}}, {"class_name": "Dense", "config": {"units": 3, "activation": "softmax", "kernel_constraint": null, "use_bias": true, "name": "dense_12", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}